<?php
 $a = array(
    'Мое хобби' => array('1'=>'Керамика','2'=>'Homescapes','3'=>'Просмотр Youtube','4'=>'Pinterest','5'=>'Йога'),
    'Мои любимые книги' => array('1'=>'Джейн Эйр-Шарлотта Бронте','2'=>'Токсичные родители-Сьюзен Форвард','Мастер и Маргарита-Михаила Булгаков','Гордость и предубеждение-Джейн Остен','Евгений Онегин-Александр Пушкин'),
    'Моя любимая музыка' => array('Nicki Minaj','SZA','Drake','Megan Thee Stallion','Doja Cat'),
    'Мои любимые фильмы'  => array('Мамма Mia!','Сумерки','Пила','Штурм белого дома', 'Телохранитель')
);